export type TypeSportsTypes =
  | 'Айкидо'
  | 'Бокатор'
  | 'Бокс'
  | 'Бразильское джиу-джитсу'
  | 'Боевое самбо'
  | 'Вольная борьба'
  | 'Греко-римская борьба'
  | 'Джиу-джитсу'
  | 'Дзюдо'
  | 'Джиткундо'
  | 'Капоэйра'
  | 'Карате'
  | 'Кикбоксинг'
  | 'Краби крабонг'
  | 'Кунг-фу'
  | 'ММА'
  | 'Муай Тай'
  | 'Рукопашный бой'
  | 'Сават'
  | 'Самбо'
  | 'Саньда'
  | 'Сумо'
  | 'Тайский бокс'
  | 'Тхэквондо'
  | 'Ушу'
  | 'Эскрима';

export const sportsTypes: TypeSportsTypes[] = [
  'Айкидо',
  'Бокатор',
  'Бокс',
  'Бразильское джиу-джитсу',
  'Боевое самбо',
  'Вольная борьба',
  'Греко-римская борьба',
  'Джиу-джитсу',
  'Дзюдо',
  'Джиткундо',
  'Капоэйра',
  'Карате',
  'Кикбоксинг',
  'Краби крабонг',
  'Кунг-фу',
  'ММА',
  'Муай Тай',
  'Рукопашный бой',
  'Сават',
  'Самбо',
  'Саньда',
  'Сумо',
  'Тайский бокс',
  'Тхэквондо',
  'Ушу',
  'Эскрима',
];
